package JSON;

import net.sf.json.JSONObject;
import org.json.JSONArray;

/**
 * @author LinWeiYu
 * @date 2018/12/6 10:22
 */
public class JSON {
    public static void main(String[] args) {
        String s = "{[\n" +
            "        {\n" +
            "            \"id\": 200001000,\n" +
            "            \"label\": \"露乐集团\",\n" +
            "            \"children\": [\n" +
            "                {\n" +
            "                    \"id\": 700187114,\n" +
            "                    \"label\": \"IT部\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 18988681823,\n" +
            "                            \"label\": \"曾龙海\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187156,\n" +
            "                            \"label\": \"运维与数据共享组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 15817170424,\n" +
            "                                    \"label\": \"周小康\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15811875181,\n" +
            "                                    \"label\": \"张恒\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13380096172,\n" +
            "                                    \"label\": \"陈达民\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187157,\n" +
            "                            \"label\": \"开发组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13610220501,\n" +
            "                                    \"label\": \"黄存伟\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18270815998,\n" +
            "                                    \"label\": \"陈超平\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13143385664,\n" +
            "                                    \"label\": \"林玮瑜\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18820789257,\n" +
            "                                    \"label\": \"黄凤燕\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18219116569,\n" +
            "                                    \"label\": \"曾棉泽\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18374154871,\n" +
            "                                    \"label\": \"邹淑芳\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13710881374,\n" +
            "                                    \"label\": \"董少奇\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187167,\n" +
            "                            \"label\": \"营销应用组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 700187165,\n" +
            "                                    \"label\": \"C端营销组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 18620020153,\n" +
            "                                            \"label\": \"许素婷\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15575911341,\n" +
            "                                            \"label\": \"邱琴\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15920568490,\n" +
            "                                            \"label\": \"谢承东\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187166,\n" +
            "                                    \"label\": \"B端营销组\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187168,\n" +
            "                            \"label\": \"ERP应用组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 17665226754,\n" +
            "                                    \"label\": \"周鹤\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187131,\n" +
            "                    \"label\": \"品牌中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 18218880008,\n" +
            "                            \"label\": \"邓胤\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13922764202,\n" +
            "                            \"label\": \"张熠秋\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13729817342,\n" +
            "                            \"label\": \"刘祥德\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15818643784,\n" +
            "                            \"label\": \"姚晨剑\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13729896960,\n" +
            "                            \"label\": \"陈春桃\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18802012241,\n" +
            "                            \"label\": \"高妍艳\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187101,\n" +
            "                            \"label\": \"消费者健康教育部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 700187145,\n" +
            "                                    \"label\": \"华东区域\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187146,\n" +
            "                                    \"label\": \"川渝区域\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13983692344,\n" +
            "                                            \"label\": \"左建伟\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187148,\n" +
            "                                    \"label\": \"北京区域\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187147,\n" +
            "                                    \"label\": \"华南区域\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13975156522,\n" +
            "                                            \"label\": \"孙敬羡\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13922447746,\n" +
            "                                            \"label\": \"龙少兵\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187149,\n" +
            "                                    \"label\": \"云南区域\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 15911744200,\n" +
            "                                            \"label\": \"宋玫蓉\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187154,\n" +
            "                                    \"label\": \"专家组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13808035608,\n" +
            "                                            \"label\": \"陈霓\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187150,\n" +
            "                            \"label\": \"媒体运营部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 15999963757,\n" +
            "                                    \"label\": \"何晓君\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187153,\n" +
            "                            \"label\": \"市场策划部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13048068362,\n" +
            "                                    \"label\": \"李靖茹\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13189052193,\n" +
            "                                    \"label\": \"罗俊青\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13416150876,\n" +
            "                                    \"label\": \"林志荣\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187151,\n" +
            "                            \"label\": \"设计部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13726277064,\n" +
            "                                    \"label\": \"魏欢如\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15876544829,\n" +
            "                                    \"label\": \"李佩恩\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187090,\n" +
            "                                    \"label\": \"露安适设计部\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 15918836231,\n" +
            "                                            \"label\": \"陈跃明\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18011772586,\n" +
            "                                            \"label\": \"陈明偏\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18922473595,\n" +
            "                                            \"label\": \"何玉婵\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15902067285,\n" +
            "                                            \"label\": \"柯艺杏\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187089,\n" +
            "                                    \"label\": \"爱乐爱设计部\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 18819247989,\n" +
            "                                            \"label\": \"唐梦婷\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187152,\n" +
            "                            \"label\": \"产品策略部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13711180827,\n" +
            "                                    \"label\": \"殷平芳\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13416189558,\n" +
            "                                    \"label\": \"彭家宝\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15775076099,\n" +
            "                                    \"label\": \"陈玉燕\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187103,\n" +
            "                    \"label\": \"会员营销中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 15972298037,\n" +
            "                            \"label\": \"李倍\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13242393292,\n" +
            "                            \"label\": \"刘家英\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187144,\n" +
            "                            \"label\": \"会员营销组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13424110046,\n" +
            "                                    \"label\": \"丘红英\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13434103272,\n" +
            "                                    \"label\": \"刘毓文\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13650768451,\n" +
            "                                    \"label\": \"胡丹\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13751801710,\n" +
            "                                    \"label\": \"向良志\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187172,\n" +
            "                            \"label\": \"数据分析组\",\n" +
            "                            \"children\": []\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187085,\n" +
            "                    \"label\": \"渠道中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 15915826223,\n" +
            "                            \"label\": \"陈芙蓉\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13229406902,\n" +
            "                            \"label\": \"肖美乐\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13822230065,\n" +
            "                            \"label\": \"郑亚俏\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18620482200,\n" +
            "                            \"label\": \"邓国平\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15018405016,\n" +
            "                            \"label\": \"张逢期\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18520187374,\n" +
            "                            \"label\": \"梁柳\",\n" +
            "                            \"children\": []\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187092,\n" +
            "                    \"label\": \"采购中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 18820787962,\n" +
            "                            \"label\": \"洪欢欢\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13148991104,\n" +
            "                            \"label\": \"徐光敏\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13823217530,\n" +
            "                            \"label\": \"皮真珍\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15876552200,\n" +
            "                            \"label\": \"吴慧玲\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18578611041,\n" +
            "                            \"label\": \"李艺海\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15773589052,\n" +
            "                            \"label\": \"何玉兰\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18813965676,\n" +
            "                            \"label\": \"林冬梅\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187135,\n" +
            "                            \"label\": \"纸品采购部\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187134,\n" +
            "                            \"label\": \"洗护采购部\",\n" +
            "                            \"children\": []\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187117,\n" +
            "                    \"label\": \"法务部\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 13760849310,\n" +
            "                            \"label\": \"陈琨崙\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 17576088520,\n" +
            "                            \"label\": \"徐林\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13316035679,\n" +
            "                            \"label\": \"吴晓红\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13539814052,\n" +
            "                            \"label\": \"林素贤\",\n" +
            "                            \"children\": []\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187128,\n" +
            "                    \"label\": \"总裁办\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 13310883302,\n" +
            "                            \"label\": \"周彧峰\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13560243840,\n" +
            "                            \"label\": \"章俊锐\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18988838292,\n" +
            "                            \"label\": \"彭海燕\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13570027092,\n" +
            "                            \"label\": \"曹文辉\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18664515931,\n" +
            "                            \"label\": \"曹以超\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13670880998,\n" +
            "                            \"label\": \"张旭鹏\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187001,\n" +
            "                            \"label\": \"营销支持部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 17711727962,\n" +
            "                                    \"label\": \"肖欣欣\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187086,\n" +
            "                                    \"label\": \"促销组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 18078864721,\n" +
            "                                            \"label\": \"袁意\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13232576860,\n" +
            "                                            \"label\": \"刘文敏\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15767298925,\n" +
            "                                            \"label\": \"莫素茵 \",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18823773973,\n" +
            "                                            \"label\": \"彭怡静 \",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18211202241,\n" +
            "                                            \"label\": \"张俞娟\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187087,\n" +
            "                                    \"label\": \"营运组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 15917473375,\n" +
            "                                            \"label\": \"黄健媚\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15918579277,\n" +
            "                                            \"label\": \"王海霞\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15918634862,\n" +
            "                                            \"label\": \"吴晓蒙\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15217656963,\n" +
            "                                            \"label\": \"饶海燕\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18219089469,\n" +
            "                                            \"label\": \" 廖健莉\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15814861376,\n" +
            "                                            \"label\": \"黄秋凤\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13512715165,\n" +
            "                                            \"label\": \"郑瑜瑜\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187126,\n" +
            "                            \"label\": \"费用组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13570282427,\n" +
            "                                    \"label\": \"陈泽惠\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13539702533,\n" +
            "                                    \"label\": \"潘彩仪\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15814874430,\n" +
            "                                    \"label\": \"沈思敏\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15217345727,\n" +
            "                                    \"label\": \"谭丽娜\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18813968748,\n" +
            "                                    \"label\": \"陈晓慧\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18899737338,\n" +
            "                                    \"label\": \"杨信华\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18813968774,\n" +
            "                                    \"label\": \"许明兰\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18924086680,\n" +
            "                                    \"label\": \"陈圆芬\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187127,\n" +
            "                            \"label\": \"行政部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13073051673,\n" +
            "                                    \"label\": \"蒲明英\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13991699385,\n" +
            "                                    \"label\": \"崔磊\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13538745896,\n" +
            "                                    \"label\": \"吴红珍\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13178809355,\n" +
            "                                    \"label\": \"兰琼芳\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13710609921,\n" +
            "                                    \"label\": \"梁德卡\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187124,\n" +
            "                    \"label\": \"财务中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 13825088078,\n" +
            "                            \"label\": \"邹开东\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187119,\n" +
            "                            \"label\": \"营销财务部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 18826413428,\n" +
            "                                    \"label\": \"刘财林\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13527855327,\n" +
            "                                    \"label\": \"梁国群\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187115,\n" +
            "                                    \"label\": \"电商财务组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13416123631,\n" +
            "                                            \"label\": \"李冬仪\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15521335535,\n" +
            "                                            \"label\": \"林淑燕\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15018746515,\n" +
            "                                            \"label\": \"童杰\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18898698896,\n" +
            "                                            \"label\": \"梁亚萍\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187116,\n" +
            "                                    \"label\": \"销售财务组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13729879534,\n" +
            "                                            \"label\": \"张茵\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13632300780,\n" +
            "                                            \"label\": \"朱庭辉\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13699748891,\n" +
            "                                            \"label\": \"蔡雯君\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15013208217,\n" +
            "                                            \"label\": \"孙小丽\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15813058786,\n" +
            "                                            \"label\": \"黄品丽\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187118,\n" +
            "                                    \"label\": \"预算分析组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13719122756,\n" +
            "                                            \"label\": \"谢玉玲\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187122,\n" +
            "                            \"label\": \"财务报告部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13560090407,\n" +
            "                                    \"label\": \"郭洁鑫\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13450226808,\n" +
            "                                    \"label\": \"杨木娇\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15915833139,\n" +
            "                                    \"label\": \"郑丹丽\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15626152765,\n" +
            "                                    \"label\": \"刘小建\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15089231914,\n" +
            "                                    \"label\": \"林嫒怡\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13602499350,\n" +
            "                                    \"label\": \"黄华英\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187123,\n" +
            "                                    \"label\": \"总账税务组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 18814104267,\n" +
            "                                            \"label\": \"潘双夏\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13728098524,\n" +
            "                                            \"label\": \"胡顺香\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13631406276,\n" +
            "                                            \"label\": \"颜晓华\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15089890242,\n" +
            "                                            \"label\": \"张朝滨\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15767457289,\n" +
            "                                            \"label\": \"李嘉玲\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187121,\n" +
            "                                    \"label\": \"成本组\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 15989328320,\n" +
            "                                            \"label\": \"肖彩兴\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187120,\n" +
            "                            \"label\": \"资金组\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13424075543,\n" +
            "                                    \"label\": \"何文静\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18825139247,\n" +
            "                                    \"label\": \"曾凤銮\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187106,\n" +
            "                    \"label\": \"人力资源中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 13922121757,\n" +
            "                            \"label\": \"张新美\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13113739851,\n" +
            "                            \"label\": \"吴荣\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187104,\n" +
            "                            \"label\": \"招聘配置部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13570375994,\n" +
            "                                    \"label\": \"廖浩文\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15622172771,\n" +
            "                                    \"label\": \"周淑霞\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13450232694,\n" +
            "                                    \"label\": \"许华东\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15692028197,\n" +
            "                                    \"label\": \"雷凤莹\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187105,\n" +
            "                            \"label\": \"绩效薪酬部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 18819493546,\n" +
            "                                    \"label\": \"甄美娥\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18620794595,\n" +
            "                                    \"label\": \"梅继红\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15889936402,\n" +
            "                                    \"label\": \"湛炜坪\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13025547496,\n" +
            "                                    \"label\": \"誉嘉欣\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187133,\n" +
            "                            \"label\": \"培训发展部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 18826485154,\n" +
            "                                    \"label\": \"林彩莲\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187112,\n" +
            "                    \"label\": \"研发中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 18620668650,\n" +
            "                            \"label\": \"许飒\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18620257128,\n" +
            "                            \"label\": \"周峰\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187136,\n" +
            "                            \"label\": \"无纺布研究部\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187138,\n" +
            "                            \"label\": \"芯体研发部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 18692279768,\n" +
            "                                    \"label\": \"聂志强\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18819492940,\n" +
            "                                    \"label\": \"陈财华\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187137,\n" +
            "                            \"label\": \"高分子研究部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 18316700898,\n" +
            "                                    \"label\": \"孙全\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13929715931,\n" +
            "                                    \"label\": \"周上凯\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187139,\n" +
            "                            \"label\": \"海外实验室\",\n" +
            "                            \"children\": []\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187005,\n" +
            "                    \"label\": \"电商中心\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 15112032141,\n" +
            "                            \"label\": \"张燕红\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15920826940,\n" +
            "                            \"label\": \"孙相广\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 13928966752,\n" +
            "                            \"label\": \"卢业威\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15017858973,\n" +
            "                            \"label\": \"林洁娜\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 15917113223,\n" +
            "                            \"label\": \"陈华芳\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18819220934,\n" +
            "                            \"label\": \"杨洁鹏\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18813973637,\n" +
            "                            \"label\": \"李丽斯\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 18565520391,\n" +
            "                            \"label\": \"何雯施\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187095,\n" +
            "                            \"label\": \"爱乐爱电商部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13725410922,\n" +
            "                                    \"label\": \"陈文丽\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18813286031,\n" +
            "                                    \"label\": \"刘浩文\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15975451062,\n" +
            "                                    \"label\": \"周秋亮\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15920143629,\n" +
            "                                    \"label\": \"陈旭陶\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187093,\n" +
            "                                    \"label\": \"爱乐爱电商运营\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13580564537,\n" +
            "                                            \"label\": \"王刚\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18322852768,\n" +
            "                                            \"label\": \"刘晓庆\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13416297619,\n" +
            "                                            \"label\": \"许雪冰\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13427624695,\n" +
            "                                            \"label\": \"张惠娟\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13030165572,\n" +
            "                                            \"label\": \"蔡春燕\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13533862706,\n" +
            "                                            \"label\": \"陈碧丽\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18665093881,\n" +
            "                                            \"label\": \"徐星\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187096,\n" +
            "                                    \"label\": \"爱乐爱电商设计\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187100,\n" +
            "                            \"label\": \"露安适电商部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13316130730,\n" +
            "                                    \"label\": \"钟中\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18302099522,\n" +
            "                                    \"label\": \"吴贞\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18825050205,\n" +
            "                                    \"label\": \"胡嘉琪\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13929508110,\n" +
            "                                    \"label\": \"胡福祥\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18312838346,\n" +
            "                                    \"label\": \"朱晓桦\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13512735648,\n" +
            "                                    \"label\": \"伍亚桦\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 18620939554,\n" +
            "                                    \"label\": \"邹晓燕\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13750093596,\n" +
            "                                    \"label\": \"李雯静\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13631324559,\n" +
            "                                    \"label\": \"徐淑婷\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 13610051331,\n" +
            "                                    \"label\": \"余静云\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15625018758,\n" +
            "                                    \"label\": \"伍海萍\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 15812343702,\n" +
            "                                    \"label\": \"陈小妹\",\n" +
            "                                    \"children\": []\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187098,\n" +
            "                                    \"label\": \"露安适电商设计\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13725330532,\n" +
            "                                            \"label\": \"刘钰\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15989293805,\n" +
            "                                            \"label\": \"何伟文\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18824700530,\n" +
            "                                            \"label\": \"康能\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15626158475,\n" +
            "                                            \"label\": \"朱云剑\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18627094893,\n" +
            "                                            \"label\": \"周洁\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13760647896,\n" +
            "                                            \"label\": \"王静琪\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15277183864,\n" +
            "                                            \"label\": \"张艺贞\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13425384820,\n" +
            "                                            \"label\": \"冯锭远\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15521116868,\n" +
            "                                            \"label\": \"张云峰\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13602470706,\n" +
            "                                            \"label\": \"龚小梅\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13422512080,\n" +
            "                                            \"label\": \"张秀茵\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                },\n" +
            "                                {\n" +
            "                                    \"id\": 700187099,\n" +
            "                                    \"label\": \"露安适电商运营\",\n" +
            "                                    \"children\": [\n" +
            "                                        {\n" +
            "                                            \"id\": 13197640486,\n" +
            "                                            \"label\": \"何建创\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15920408399,\n" +
            "                                            \"label\": \"黎建辉\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15915866962,\n" +
            "                                            \"label\": \"蔡小宁\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18529115570,\n" +
            "                                            \"label\": \"陈宇清\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 18978302142,\n" +
            "                                            \"label\": \"陈仕新\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 17602315175,\n" +
            "                                            \"label\": \"李晶晶\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15217476207,\n" +
            "                                            \"label\": \"曹亮亮\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 13801139984,\n" +
            "                                            \"label\": \"程建玲\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15989050591,\n" +
            "                                            \"label\": \"李紫\",\n" +
            "                                            \"children\": []\n" +
            "                                        },\n" +
            "                                        {\n" +
            "                                            \"id\": 15813813377,\n" +
            "                                            \"label\": \"郑晓楷\",\n" +
            "                                            \"children\": []\n" +
            "                                        }\n" +
            "                                    ]\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187141,\n" +
            "                            \"label\": \"电商分销部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 18665602950,\n" +
            "                                    \"label\": \"吴满琼\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187142,\n" +
            "                            \"label\": \"京东直营部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 15202059897,\n" +
            "                                    \"label\": \"张盈盈\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                },\n" +
            "                {\n" +
            "                    \"id\": 700187171,\n" +
            "                    \"label\": \"海外事业部\",\n" +
            "                    \"children\": [\n" +
            "                        {\n" +
            "                            \"id\": 13560491005,\n" +
            "                            \"label\": \"刘姣\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187170,\n" +
            "                            \"label\": \"国际业务拓展部\",\n" +
            "                            \"children\": []\n" +
            "                        },\n" +
            "                        {\n" +
            "                            \"id\": 700187169,\n" +
            "                            \"label\": \"国际供应链部\",\n" +
            "                            \"children\": [\n" +
            "                                {\n" +
            "                                    \"id\": 13632182557,\n" +
            "                                    \"label\": \"莫若\",\n" +
            "                                    \"children\": []\n" +
            "                                }\n" +
            "                            ]\n" +
            "                        }\n" +
            "                    ]\n" +
            "                }\n" +
            "            ]\n" +
            "        }\n" +
            "    ]}";
        JSONObject json = JSONObject.fromObject(s);
    }
}
